"""
位运算符：
<< : 二进制操作数左移
    a << n ---> a*2^n
>> : 二进制操作数右移
    a >> n ---> a//2^n
&（与）: 两个二进制的操作数，全为1结果为1，其他情况为0
    3 & 5 ---> 1
        0000 0011
      & 0000 0101
      ------------
        0000 0001
|（或）: 两个二进制位的操作数，只要有一个为1，结果为1，都为0的时候，结果为0
    3 | 5 ---> 7
        0000 0011
      | 0000 0101
      ------------
        0000 0111
^（异或）: 两个二进制位的操作数，相同为0，不同为1。对同一个数字异或两次能够得到它本身
    3 ^ 5 ---> 6
        0000 0011
      ^ 0000 0101
      ------------
        0000 0110
~（取反）:
        ~ 5 ---> -6
        ~0000 0101 ---> 1111 1010 (这是一个补码，变成原码应该进行取反+1操作)
        --->1000 0101(除符号位之外其他位取反)--->1000 0110(加1变成原码)
    
"""

print(2<<2)
print(2<<3)
print(8>>2)
print(8>>3)
print('-'*40)
print(3&5)
print(3|5)
print('-'*40)
print(3^5)
a = 3
b = 5
a = a^b
print(a)
a = a^b
print(a)
print('-'*40)
print(~5)


